app/controllers/api/v1/api_controller.rb

  def check_authenticate_user
    if request.headers[:token].present?
      @auth_token = AuthToken.find_by(token: request.headers[:token])
      @current_user = auth_token.user if @auth_token.present?
---
SELECT "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 LIMIT $2  [["token", "0c536f6300fe6ee41fe0ec5d"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]