app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "absadasdf221c@gmail.com"], ["LIMIT", 1]]
INSERT INTO "auth_tokens" ("token", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["token", "c82689a3478d8fdaa9d038f1"], ["user_id", 5], ["created_at", "2020-05-20 14:23:40.495761"], ["updated_at", "2020-05-20 14:23:40.495761"]]
---
  def create
    if params['user'].present? && params['user']['email'].present?
	   user = User.find_by(email: params['user']['email'])
      if user && user.valid_password?(params['user']['password'])
        @auth_token = AuthToken.create(user_id: user.id, token: SecureRandom.hex(12))

DELETE FROM "auth_tokens" WHERE "auth_tokens"."id" = $1  [["id", 5]]
---
  def logout
    if auth_token.present? && auth_token.destroy

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abc@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abc@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "is_admin") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "auth_tokens" ("token", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["token", "2d224fa0a7f193cc403a53dd"], ["user_id", 1], ["created_at", "2020-05-20 14:13:51.848778"], ["updated_at", "2020-05-20 14:13:51.848778"]]
---
  def user_registration
    if params['user'].present? && params['user']['email'].present?
    	user = User.find_by(email: params['user']['email'])
        if user.present?
          error_response_with_obj(HTTP_NOT_FOUND[:code], "Email ID Already register with us.")
        else
          user = User.new(user_params)
          user.save
          @auth_token = AuthToken.create(user_id: user.id, token: SecureRandom.hex(12))