app/controllers/api/v1/twitts_controller.rb

  	def create
		if params['twitt'].present? && params['twitt']['message'].present?
			twitt = current_user.twitts.create(twitt_params)
---
INSERT INTO "twitts" ("message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "sdfsdfdsfsdfsdfsdfsd"], ["user_id", 5], ["created_at", "2020-05-20 14:59:16.255545"], ["updated_at", "2020-05-20 14:59:16.255545"]]

  	def destroy
  		twitt = Twitt.find_by id: params[:id]
  		if twitt.present?
  			if twitt.user_id == current_user.id || current_user.is_admin?
			    twitt.destroy
---
SELECT "twitts".* FROM "twitts" WHERE "twitts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "twitts" WHERE "twitts"."id" = $1  [["id", 5]]

  	def show
  		twitt = Twitt.find_by id: params[:id]
---
SELECT "twitts".* FROM "twitts" WHERE "twitts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

	def update
  		twitt = Twitt.find_by id: params[:id]
  		if twitt.present?
  			if twitt.user_id == current_user.id || current_user.is_admin?
			    twitt.update(twitt_params)
---
SELECT "twitts".* FROM "twitts" WHERE "twitts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "twitts" SET "message" = $1, "updated_at" = $2 WHERE "twitts"."id" = $3  [["message", "newupdate"], ["updated_at", "2020-05-20 15:22:21.281946"], ["id", 5]]

  	def index
  		twitts = Twitt.all
---
SELECT "twitts".* FROM "twitts"